user_input = input("Введи 4-х значне число: ") #Нехай користувач надрукував 1234.
number = int(user_input) #Цей рядок перетворює строку, введену користувачем, у ціле число за допомогою функції int(), і зберігає це число у змінній number.

#Виведення кожної цифри числа у вигляді стовпчика. Виведе 4321
print(number % 10 // 1, end="") #Ця операція визначає останню цифру числа number. Виведе 4
print(number % 100 // 10, end="") #Ця операція отримує передостанню цифру числа number. Виведе 3
print(number % 1000 // 100, end="") #Ця операція отримує третю цифру числа number. Виведе 2
print(number % 10000 // 1000, end="") #Ця операція отримує четверту цифру числа number. Виведе 1
#Всі ці вирази друкуються в одному рядку через використання параметру end=""