while True: #Pядок починає нескінченний цикл. True - це логічне значення, завжди істинне.
    #Цикл буде виконуватися, поки не буде викликано оператор break.
    try: #Pядок починає блок коду, який може викликати виняток (помилку), який можна обробити.
        # Введення чисел та операції
        num1 = float(input("Введіть перше число: ")) #Запит про перше число та збереження його значення у змінній num1.
        #Функція input виводить повідомлення "Введіть перше число: "
        #функція float перетворює введене значення у десяткове число (з плаваючою точкою).
        num2 = float(input("Введіть друге число: "))
        operation = input("Введіть операцію (+, -, *, /): ")#Запит про операцію, збереження її у змінній operation.

# Обчислення та виведення результату
        if operation == '+': #Умовна конструкція if визначає, яку операцію треба виконати на введених числах
            result = num1 + num2 #Додаються num1 та num2, бо operation == '+'
        elif operation == '-': #Умовна конструкція elif визначає, яку операцію треба виконати на введених числах
            result = num1 - num2 #Від num1 віднімається num2,бо operation == '-'
        elif operation == '*': #Умовна конструкція elif визначає, яку операцію треба виконати на введених числах
            result = num1 * num2 #Перемножаються num1 та num2, бо operation == '/'
        elif operation == '/': #Умовна конструкція elif визначає, яку операцію треба виконати на введених числах
            if num2 == 0:  #Перевіряється, чи num2 не дорівнює нулю, якщо ні, то виконується ділення num1 на num2.
                #Якщо так, то застосовується виняток ZeroDivisionError.
                raise ZeroDivisionError("Помилка: ділення на нуль!")#Виводить помилку (ділення на нуль, num2=0)
            result = num1 / num2 #Ділення числа num1 на число num2, збереження результата у змінній result.
        else:
            print("Неправильна операція! Спробуйте ще раз.")#Якщо ні одна з перевірок не відповідає
            continue #Повертаємось до початку циклу

        print("Результат:", result)#Виводить результат виконаної операції на екрані

        # Вихід з циклу
        break #Результат виведено, програма завершує свою роботу
    except ValueError: #Блок except ValueError обробляє помилку, якщо введено невірні дані (напр.рядок замість числа)
        print("Будь ласка, введіть числа.")
    except ZeroDivisionError as error:#Блок except ZeroDivisionError обробляє помилку, якщо ділити на нуль.
        print(error)