my_list = [3, 1, 4, 1, 5, 9, 2, 6, 5] #Створюємо список my_list з цими числами
last_element = my_list.pop()  #Видаляємо останній елемент списку my_list (число 5).
#Він зберігається у змінну last_element.
# Метод pop() без аргументів видаляє останній елемент списку і повертає його значення.
my_list.insert(0, last_element) #Вставляємо збережений останній елемент (число 5)
#на початок списку за допомогою методу insert().
#Метод insert() використовується для вставки елемента у список my_list на позицію з індексом 0.
print(my_list)#Виводиться 5, 3, 1, 4, 1, 5, 9, 2, 6


#my_list.insert(0, last_element)
#Перший аргумент методу insert() вказує на позицію, на яку потрібно вставити елемент,
#позиція з індексом 0, тобто на початок списку.
#Другий аргумент методу insert() вказує на елемент, який потрібно вставити,
#Значення змінної last_element (збереженого останнього елемента списку) вставляється на початок списку my_list.