user_input = input("Введи 5-ти значне число: ")  # Нехай користувач надрукував 12345
number = int(user_input)

# Виведення у зворотньому порядку кожної цифри числа у вигляді рядка. Виведе 54321
if 10000 <= number <= 99999:
    print(number % 10, end='')  # Ця операція отримує першу цифру числа number. Виведе 5
    print(number % 100 // 10, end='')  # Ця операція отримує другу цифру числа number. Виведе 4
    print(number % 1000 // 100, end='')  # Ця операція отримує третю цифру числа number. Виведе 3
    print(number % 10000 // 1000, end='')  # Ця операція отримує передостанню цифру числа number. Виведе 2
    print(number // 10000, end='')  # Ця операція отримує останню цифру числа number. Виведе 1
else:
    print("Введи коректне число: ")