user_input = input("Введи 4-х значне число: ") #Нехай користувач надрукував 1234. Цей рядок запускає функцію input, яка виводить повідомлення "Введи 4-х значне число: " і чекає, доки користувач введе якийсь ввід з клавіатури. Введена користувачем строка буде збережена у змінній user_input.
number = int(user_input) #Цей рядок перетворює строку, введену користувачем, у ціле число за допомогою функції int(), і зберігає це число у змінній number.

#Виведення кожної цифри числа у вигляді стовпчика. Виведе в стовбчик 1234
print(number % 10000 // 1000) #Ця операція отримує першу цифру числа number. Виведе 1
print(number % 1000 // 100) #Ця операція отримує другу цифру числа number. Виведе 2
print(number % 100 // 10) #Ця операція отримує передостанню цифру числа number. Виведе 3
print(number % 10 // 1) #Ця операція визначає останню цифру числа number. Виведе 4

